Revit 2024 API
SATImportOptions Class
 The import options used to import SAT format files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class SATImportOptions : BaseImportOptions
Visual Basic
Public Class SATImportOptions _
	Inherits BaseImportOptions
Visual C++
public ref class SATImportOptions : public BaseImportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.SATImportOptions
See Also
SATImportOptions Members
Autodesk.Revit.DB Namespace